programming/maven/maven.org
* pom

maven 的核心为 pom, 通过 pom.xml 配置，定义了 project，包括配置和源码。

配置包括与开发者相关的，缺陷跟踪系统，组织和许可，项目 URL，项目信赖以及其他。

pom.xml 中的核心元素包括

- project :: 声明一些命名空间及 xsd（让第三方工具快速编辑 pom）
- modelVersion :: =4.0.0= （对于 maven2 和 maven3）
- groupId ::
- artifactId ::
- version ::
- name :: 建议每个 pom 声明 name，指定项目名称
- dependencies/dependicy :: 坐标依赖
- scope :: 依赖范围

* dependency 插件

从外网攒 jar 包，用 =dependency:get= 插件，具体用法如：

#+BEGIN_SRC shell
mvn dependency:get -DartifactId=spark-sql_2.11 -DgroupId=org.apache.spark -Dversion=2.1.1 -Dclassifier=sources
#+END_SRC

其中 classifier 为可选的，用于下载 javadoc 或 sources

* repositories 配置

** TODO 在工程 pom.xml 配置

待补充

** 在 settings.xml 配置

在 =~/.m2/settings.xml= 中 profiles 一节中添加配置，如下

#+BEGIN_SRC xml
  <profile>
    <id>cloudera</id>
    <repositories>
      <repository>
	<id>cloudera</id>
	<name>cloudera repo</name>
	<url>https://repository.cloudera.com/artifactory/cloudera-repos/</url>
      </repository>
    </repositories>
  </profile>
#+END_SRC

使用时，需要为 maven 指定 profile，如 =mvn -Pcloudera=

* mirror 配置

国内中央镜像源可以使用阿里镜像，在 =~/.m2/settings.xml= 中添加

#+BEGIN_SRC xml
  <mirrors>
    <mirror>
      <id>aliyun</id>
      <mirrorOf>central</mirrorOf>
      <name>Human Readable Name for this Mirror.</name>
      <url>http://maven.aliyun.com/nexus/content/groups/public</url>
    </mirror>
  </mirrors>
#+END_SRC


* build classpath 

=maven dependency:build-classpath= 可以从当前工程（pom.xml）中生成 classpath

比如 spark hive 需要指定 classpath，可以

1. 从 =hive-exec= jar 包中提取 pom.xml
2. 使用 =maven dependency:build-classpath= 命令生成 classpath
3. classpath 中补充 hive-exec 所在的本地 jar 包路径
